# Blender使用笔记

在场景合集里面
A键 全选
x键 删除

SHIFT+A 创建


SHIFT+C 重置游标回原点

E 挤出

CTRL+R 添加循环边 鼠标滚轮确定数量 右键居中 左键选择位置

面模式 I 内插面

ALT + Z 透视模式 可选择背面元素

~ 选择视图

融并边，把边合成一个面

选择点，网格，变化，球型化

挤出各面，是复制各个面的顶点

表面细分修改器

边模式，CTRL+B 添加倒角

边模式 alt 选择，可以选中一条循环边

内插面的时候，可以点击右下角的设置，选择插入各自的面

修改器中，选择实时，可以马上查看当前修改结果

选中面时，CTRL+小键盘的+号，可附近多选

设置顶点组，指定，可以将选定的顶点分成一组

使用材质的时候，需要调整着色方式

内插面边界，边界的会不插入那条边

CTRL + I 反选

阵列修改器，重复选中模型

阵列修改器，物体偏移，能根据指定的物体进行变换，相对偏移，根据指定的值
合并，能合并顶点，第一个和最后一个

修改器应用，应用当前修改器的值，并且删除修改器

顶点模式，合并顶点到中心

实体化修改器，添加厚度

图像 => 参考图

alt + G 坐标归零
clt + R 旋转归零

图片，不透明度

ALT + S 法向挤出

边模式 选中两条边 F 键桥接，可以将两个线中间连起来变成一个面

选中物体 CTRL + A 应用全部变换，使得使用当前修改，并且全部修改重置

顶点模式 合并顶点 按距离，合并近的顶点为一个、

选择循环边 F 键填充面

SZ 0 缩放，选择轴， 0 将点沿z轴对齐

K 切割 空格确定

右上角选项，工具打开，勾选自动合并，选择吸附，顶点吸附，移动顶点，则可以合并想要的两个顶点

选择循环面时，选择相应的边可以确定往哪个方向循环

线框修改器，让线的部分变成实体线，类似于垃圾桶网格效果
如果要选择指定的顶点线加线框，可以线选择顶点组，再指定

遮罩修改器，只渲染指定的顶点组

多边形功能，先新建一个平面网格，然后打开顶点吸附，自动合并，可以沿着边拓展

H 键隐藏

SHIFT+D复制选中内容